package main.java.com.alevel.alevelClassWorks.arraysTypicalProblems.problem8;

/*8. Последовательность действительных чисел оканчивается нулем.
Найти количество членов этой последовательности.*/
public class Problem8 {
    public static void main(String[] args) {
        int [] sequence = {152,-25,155,59,-1,289,0};
        System.out.println("the quantity members of this sequence equals : "+sequence.length);
    }
}
